// © Copyright 2010, 2015-2016 HP Development Company, L.P.

TaskName = "コンピュータにスキャン";

// Restore alert message
"RESTORE_TITLE" = "設定を復元してもよろしいですか?";
"RESTORE_MSG" = "続行すると、すべてのスキャンのショートカットはデフォルトの状態に戻ります。ショートカットを変更しない場合は [キャンセル]、ショートカットを出荷時のデフォルト設定に戻す場合は [復元] を押してください。";
"RESTORE_BUTTON_TITLE" = "復元";

"DEFAULT_TASK_CAPTION" = "タスク名:";
"DONE" = "完了";

// Task not found alert message
"TASK_NOT_FOUND_TITLE" = "タスクは使用できません";
"TASK_NOT_FOUND_DESC" = "デバイスで見つかった \"%@\" タスクは、お使いのシステムで利用できません。別のタスクを選択してください。";

// Copy workflows fail alert message
"COPY_WORKFLOWS_TITLE" = "ワークフローのコピーに失敗しました";
"COPY_WORKFLOWS_DESC" = "ワークフローをユーザー デバイス ドメイン フォルダにコピーできませんでした";

"DEVICE_NOT_FOUND_TITLE" = "デバイスが見つかりません";
"DEVICE_NOT_FOUND_DESC" = "デバイスとの通信中に問題が発生しました。デバイスの電源が入り、正しく接続されていることを確認して、もう一度やり直してください。";

"COMPUTER_NAME_INFO_TITLE" = "[コンピュータ名] フィールドには HP デバイスで表示するコンピュータの名前を入力します。"; //title for the Computer name info sheet
"COMPUTER_NAME_INFO_DESC" = "入力できる文字数は、お使いのデバイスによって異なります。";

"UNKNOWN_ERROR_TITLE" = "不明なエラー";
"UNKNOWN_ERROR_DESC" = "デバイスの更新中に不明なエラーが発生しました。デバイスの電源が入り、正しく接続されていることを確認してください。";

"OK" = "OK";
"CANCEL" = "キャンセル";

"MOREINFO_TITLE" = "詳細情報";

// The following strings are displayed in SSMTaskController nib file

"SSM_TITLE" = "スキャンのショートカット マネージャ"; // Title
"SSM_SHORT_DESC" = "スキャンのショートカットを使用すると HP デバイスの前面パネルにあるコントロールから一般的なスキャン タスクを実行できます。"; // short description
"YOUR_COMPUTER_NAME" = "使用中のコンピュータ名:"; // displayed if device is connected through n/w
"CHANGE_BTN_TITLE" = "変更...";
"MORE_INFO_BTN_TITLE" = "詳細情報...";
"RESTORE_BTN_TITLE" = "デフォルトに戻す";
"TEST_BTN_TITLE" = "テスト...";
"EDIT_BTN_TITLE" = "編集...";

// Error Messages
"ERROR_PERMISSION_DENIED" = "“%@” フォルダへのアクセス権がありません。アクセス権を表示または変更するには、Finder でアイテムを選択し、[ファイル]、[情報取得] の順に選択します。"; // used from HPWFM, no need to get the localized string from customer.

// generic error
"ERROR" = "エラー";
"ERROR_UNKNOWN_DESC" = "不明なエラーが発生しました。";

// Error when workflow not found when user clicks on front panel scan
"ERROR_SHORTCUT_NOT_FOUND_TITLE" = "ショートカットが見つかりません";
"ERROR_SHORTCUT_NOT_FOUND_DESC" = "デバイス %2$@ のショートカット %1$@ が見つかりませんでした。ソフトウェアを再インストールしてください。";

// Error displayed when HPScanWorkflow object creation fails for execution of workflow in SEH interface execute method
"ERROR_WORKFLOW_CREATE_FAIL_TITLE" = "ワークフローの作成に失敗しました";
"ERROR_WORKFLOW_CREATE_FAIL_DESC" = "ワークフロー作成中に不明なエラーが発生しました。もう一度やり直してください。";

// Error displayed when copyworkflows fails as due to non availability of permission at user device domain folder
"ERROR_CREATING_DIR_TITLE" = "ディレクトリの作成中にエラーが発生しました";
"ERROR_CREATING_DIR_DESC" = "%@ ディレクトリの作成中にエラーが発生しました。親フォルダのアクセス権を確認し、もう一度やり直してください。";

// Error displayed when workflow does not exists when user tries to open the same in Automator
"ERROR_OPENING_WORKFLOW_IN_AUTOMATOR_DESC" = "Automator で “%@” ワークフローを開いている時にエラーが発生しました。ワークフローが元の場所に見つかりませんでした。";

// New additions: 3/1/2010

// Error displayed when scan link ID received from the device is invalid
"ERROR_INVALID_SCAN_LINK_ID_TITLE" = "スキャンのショートカットはサポートされていません";
"ERROR_INVALID_SCAN_LINK_ID_DESC" = "選択されたスキャン ショートカットはソフトウェアに認識されていないため実行できません。別のスキャンショートカットを選択してもう一度やり直してください。";

// Tool tips for change, edit and test button
"TIP_FOR_CHANGE_BTN" = "クリックして、コンピュータ名を変更してください。";
"TIP_FOR_EDIT_BTN" = "選択したタスクを編集する";
"TIP_FOR_TEST_BTN" = "選択したタスクを実行する";

// New additions: 3/1/2010

// Opt-in/Opt-out strings
"COMPUTER_NAME_TITLE" = "コンピュータ名";
"COMPUTER_NAME_DESCRIPTION" = "HP デバイスからスキャンを開始する場合、[コンピュータにスキャン] が有効になっているホスト コンピュータのリストからコンピュータを選択するよう要求される場合があります。";
"COMPUTER" = "コンピュータ";
"COMPUTERS" = "コンピュータ";

"COMMUNICATION_ERROR" = "スキャナとの通信を確立できません。デバイスの電源がオンであることを確認し、接続をチェックし、ネットワークが正しく動作していることを確認してください。また、デバイスで Bonjour が有効になっている必要があることに注意してください。";
"INSTALLATION_ERROR" = "[コンピュータにスキャン] に必要な HP ソフトウェアがこのコンピュータに見つかりません。お使いのデバイス用の最新の HP 推奨ソフトウェアを http://www.hp.com/support からダウンロードしてインストールしてからやり直してください。";

"SCAN_TO_COMPUTER_CANNOT_BE_ENABLED" = "[コンピュータにスキャン] を有効にできません";
"SCAN_TO_COMPUTER_DESCRIPTION" = "[コンピュータにスキャン] を使用すると、HP デバイスの前面パネルでスキャンを開始し、出力をコンピュータに自動的に送信できます。";

HSDScanActionNotFoundTitle = "スキャン操作が見つかりません";
HSDScanActionNotFoundDescription = "スキャン操作が登録されていません。'%@' に存在する HP Scan アプリケーションを起動して、スキャン操作を自動で登録してください。";
